Infineon/AURIX_code_examples/code_examples/OneEye_UART_Mux_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxEvadc_reg.h
/** \brief 2E04, Group 10, Channel 1 Control Register */
#define EVADC_G10_CHCTR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E04u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR1.
* To use register names with standard convension, please use EVADC_G10_CHCTR1.
*/
#define EVADC_G10CHCTR1 (EVADC_G10_CHCTR1)

/** \brief 2E08, Group 10, Channel 2 Control Register */
#define EVADC_G10_CHCTR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E08u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR2.
* To use register names with standard convension, please use EVADC_G10_CHCTR2.
*/
#define EVADC_G10CHCTR2 (EVADC_G10_CHCTR2)

/** \brief 2E0C, Group 10, Channel 3 Control Register */
#define EVADC_G10_CHCTR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E0Cu)
/** Alias (User Manual Name) for EVADC_G10_CHCTR3.
* To use register names with standard convension, please use EVADC_G10_CHCTR3.
*/
#define EVADC_G10CHCTR3 (EVADC_G10_CHCTR3)

/** \brief 2E10, Group 10, Channel 4 Control Register */
#define EVADC_G10_CHCTR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E10u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR4.
* To use register names with standard convension, please use EVADC_G10_CHCTR4.
*/
#define EVADC_G10CHCTR4 (EVADC_G10_CHCTR4)

/** \brief 2E14, Group 10, Channel 5 Control Register */
#define EVADC_G10_CHCTR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E14u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR5.
* To use register names with standard convension, please use EVADC_G10_CHCTR5.
*/
#define EVADC_G10CHCTR5 (EVADC_G10_CHCTR5)

/** \brief 2E18, Group 10, Channel 6 Control Register */
#define EVADC_G10_CHCTR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E18u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR6.
* To use register names with standard convension, please use EVADC_G10_CHCTR6.
*/
#define EVADC_G10CHCTR6 (EVADC_G10_CHCTR6)

/** \brief 2E1C, Group 10, Channel 7 Control Register */
#define EVADC_G10_CHCTR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E1Cu)
/** Alias (User Manual Name) for EVADC_G10_CHCTR7.
* To use register names with standard convension, please use EVADC_G10_CHCTR7.
*/
#define EVADC_G10CHCTR7 (EVADC_G10_CHCTR7)

/** \brief 2E20, Group 10, Channel 8 Control Register */
#define EVADC_G10_CHCTR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E20u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR8.
* To use register names with standard convension, please use EVADC_G10_CHCTR8.
*/
#define EVADC_G10CHCTR8 (EVADC_G10_CHCTR8)

/** \brief 2E24, Group 10, Channel 9 Control Register */
#define EVADC_G10_CHCTR9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E24u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR9.
* To use register names with standard convension, please use EVADC_G10_CHCTR9.
*/
#define EVADC_G10CHCTR9 (EVADC_G10_CHCTR9)

/** \brief 2E28, Group 10, Channel 10 Control Register */
#define EVADC_G10_CHCTR10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E28u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR10.
* To use register names with standard convension, please use EVADC_G10_CHCTR10.
*/
#define EVADC_G10CHCTR10 (EVADC_G10_CHCTR10)

/** \brief 2E2C, Group 10, Channel 11 Control Register */
#define EVADC_G10_CHCTR11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E2Cu)
/** Alias (User Manual Name) for EVADC_G10_CHCTR11.
* To use register names with standard convension, please use EVADC_G10_CHCTR11.
*/
#define EVADC_G10CHCTR11 (EVADC_G10_CHCTR11)

/** \brief 2E30, Group 10, Channel 12 Control Register */
#define EVADC_G10_CHCTR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E30u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR12.
* To use register names with standard convension, please use EVADC_G10_CHCTR12.
*/
#define EVADC_G10CHCTR12 (EVADC_G10_CHCTR12)

/** \brief 2E34, Group 10, Channel 13 Control Register */
#define EVADC_G10_CHCTR13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E34u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR13.
* To use register names with standard convension, please use EVADC_G10_CHCTR13.
*/
#define EVADC_G10CHCTR13 (EVADC_G10_CHCTR13)

/** \brief 2E38, Group 10, Channel 14 Control Register */
#define EVADC_G10_CHCTR14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E38u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR14.
* To use register names with standard convension, please use EVADC_G10_CHCTR14.
*/
#define EVADC_G10CHCTR14 (EVADC_G10_CHCTR14)

/** \brief 2E3C, Group 10, Channel 15 Control Register */
#define EVADC_G10_CHCTR15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E3Cu)
/** Alias (User Manual Name) for EVADC_G10_CHCTR15.
* To use register names with standard convension, please use EVADC_G10_CHCTR15.
*/
#define EVADC_G10CHCTR15 (EVADC_G10_CHCTR15)

/** \brief 2E80, Group 10 Result Control Register 0 */
#define EVADC_G10_RCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022E80u)
/** Alias (User Manual Name) for EVADC_G10_RCR0.
* To use register names with standard convension, please use EVADC_G10_RCR0.
*/
#define EVADC_G10RCR0 (EVADC_G10_RCR0)

/** \brief 2E84, Group 10 Result Control Register 1 */
#define EVADC_G10_RCR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022E84u)
/** Alias (User Manual Name) for EVADC_G10_RCR1.
* To use register names with standard convension, please use EVADC_G10_RCR1.
*/
#define EVADC_G10RCR1 (EVADC_G10_RCR1)

/** \brief 2E88, Group 10 Result Control Register 2 */
#define EVADC_G10_RCR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022E88u)
/** Alias (User Manual Name) for EVADC_G10_RCR2.
* To use register names with standard convension, please use EVADC_G10_RCR2.
*/
#define EVADC_G10RCR2 (EVADC_G10_RCR2)

/** \brief 2E8C, Group 10 Result Control Register 3 */
#define EVADC_G10_RCR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022E8Cu)
/** Alias (User Manual Name) for EVADC_G10_RCR3.
* To use register names with standard convension, please use EVADC_G10_RCR3.
*/
#define EVADC_G10RCR3 (EVADC_G10_RCR3)

/** \brief 2E90, Group 10 Result Control Register 4 */
#define EVADC_G10_RCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022E90u)
/** Alias (User Manual Name) for EVADC_G10_RCR4.
* To use register names with standard convension, please use EVADC_G10_RCR4.
*/
#define EVADC_G10RCR4 (EVADC_G10_RCR4)

