Infineon/AURIX_code_examples/code_examples/OneEye_UART_Mux_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxEvadc_reg.h
/** \brief 329C, Group 11 Result Control Register 7 */
#define EVADC_G11_RCR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF002329Cu)
/** Alias (User Manual Name) for EVADC_G11_RCR7.
* To use register names with standard convension, please use EVADC_G11_RCR7.
*/
#define EVADC_G11RCR7 (EVADC_G11_RCR7)

/** \brief 32A0, Group 11 Result Control Register 8 */
#define EVADC_G11_RCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00232A0u)
/** Alias (User Manual Name) for EVADC_G11_RCR8.
* To use register names with standard convension, please use EVADC_G11_RCR8.
*/
#define EVADC_G11RCR8 (EVADC_G11_RCR8)

/** \brief 32A4, Group 11 Result Control Register 9 */
#define EVADC_G11_RCR9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00232A4u)
/** Alias (User Manual Name) for EVADC_G11_RCR9.
* To use register names with standard convension, please use EVADC_G11_RCR9.
*/
#define EVADC_G11RCR9 (EVADC_G11_RCR9)

/** \brief 32A8, Group 11 Result Control Register 10 */
#define EVADC_G11_RCR10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00232A8u)
/** Alias (User Manual Name) for EVADC_G11_RCR10.
* To use register names with standard convension, please use EVADC_G11_RCR10.
*/
#define EVADC_G11RCR10 (EVADC_G11_RCR10)

/** \brief 32AC, Group 11 Result Control Register 11 */
#define EVADC_G11_RCR11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00232ACu)
/** Alias (User Manual Name) for EVADC_G11_RCR11.
* To use register names with standard convension, please use EVADC_G11_RCR11.
*/
#define EVADC_G11RCR11 (EVADC_G11_RCR11)

/** \brief 32B0, Group 11 Result Control Register 12 */
#define EVADC_G11_RCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00232B0u)
/** Alias (User Manual Name) for EVADC_G11_RCR12.
* To use register names with standard convension, please use EVADC_G11_RCR12.
*/
#define EVADC_G11RCR12 (EVADC_G11_RCR12)

/** \brief 32B4, Group 11 Result Control Register 13 */
#define EVADC_G11_RCR13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00232B4u)
/** Alias (User Manual Name) for EVADC_G11_RCR13.
* To use register names with standard convension, please use EVADC_G11_RCR13.
*/
#define EVADC_G11RCR13 (EVADC_G11_RCR13)

/** \brief 32B8, Group 11 Result Control Register 14 */
#define EVADC_G11_RCR14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00232B8u)
/** Alias (User Manual Name) for EVADC_G11_RCR14.
* To use register names with standard convension, please use EVADC_G11_RCR14.
*/
#define EVADC_G11RCR14 (EVADC_G11_RCR14)

/** \brief 32BC, Group 11 Result Control Register 15 */
#define EVADC_G11_RCR15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00232BCu)
/** Alias (User Manual Name) for EVADC_G11_RCR15.
* To use register names with standard convension, please use EVADC_G11_RCR15.
*/
#define EVADC_G11RCR15 (EVADC_G11_RCR15)

/** \brief 3300, Group 11 Result Register 0\n */
#define EVADC_G11_RES0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0023300u)
/** Alias (User Manual Name) for EVADC_G11_RES0.
* To use register names with standard convension, please use EVADC_G11_RES0.
*/
#define EVADC_G11RES0 (EVADC_G11_RES0)

/** \brief 3304, Group 11 Result Register 1\n */
#define EVADC_G11_RES1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0023304u)
/** Alias (User Manual Name) for EVADC_G11_RES1.
* To use register names with standard convension, please use EVADC_G11_RES1.
*/
#define EVADC_G11RES1 (EVADC_G11_RES1)

/** \brief 3308, Group 11 Result Register 2\n */
#define EVADC_G11_RES2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0023308u)
/** Alias (User Manual Name) for EVADC_G11_RES2.
* To use register names with standard convension, please use EVADC_G11_RES2.
*/
#define EVADC_G11RES2 (EVADC_G11_RES2)

/** \brief 330C, Group 11 Result Register 3\n */
#define EVADC_G11_RES3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002330Cu)
/** Alias (User Manual Name) for EVADC_G11_RES3.
* To use register names with standard convension, please use EVADC_G11_RES3.
*/
#define EVADC_G11RES3 (EVADC_G11_RES3)

/** \brief 3310, Group 11 Result Register 4\n */
#define EVADC_G11_RES4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0023310u)
/** Alias (User Manual Name) for EVADC_G11_RES4.
* To use register names with standard convension, please use EVADC_G11_RES4.
*/
#define EVADC_G11RES4 (EVADC_G11_RES4)

/** \brief 3314, Group 11 Result Register 5\n */
#define EVADC_G11_RES5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0023314u)
/** Alias (User Manual Name) for EVADC_G11_RES5.
* To use register names with standard convension, please use EVADC_G11_RES5.
*/
#define EVADC_G11RES5 (EVADC_G11_RES5)

/** \brief 3318, Group 11 Result Register 6\n */
#define EVADC_G11_RES6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0023318u)
/** Alias (User Manual Name) for EVADC_G11_RES6.
* To use register names with standard convension, please use EVADC_G11_RES6.
*/
#define EVADC_G11RES6 (EVADC_G11_RES6)

/** \brief 331C, Group 11 Result Register 7\n */
#define EVADC_G11_RES7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002331Cu)
/** Alias (User Manual Name) for EVADC_G11_RES7.
* To use register names with standard convension, please use EVADC_G11_RES7.
*/
#define EVADC_G11RES7 (EVADC_G11_RES7)

/** \brief 3320, Group 11 Result Register 8\n */
#define EVADC_G11_RES8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0023320u)
/** Alias (User Manual Name) for EVADC_G11_RES8.
* To use register names with standard convension, please use EVADC_G11_RES8.
*/
#define EVADC_G11RES8 (EVADC_G11_RES8)

/** \brief 3324, Group 11 Result Register 9\n */
#define EVADC_G11_RES9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0023324u)
/** Alias (User Manual Name) for EVADC_G11_RES9.
* To use register names with standard convension, please use EVADC_G11_RES9.
*/
#define EVADC_G11RES9 (EVADC_G11_RES9)

/** \brief 3328, Group 11 Result Register 10\n */
#define EVADC_G11_RES10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0023328u)
/** Alias (User Manual Name) for EVADC_G11_RES10.
* To use register names with standard convension, please use EVADC_G11_RES10.
*/
#define EVADC_G11RES10 (EVADC_G11_RES10)

/** \brief 332C, Group 11 Result Register 11\n */
#define EVADC_G11_RES11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002332Cu)
/** Alias (User Manual Name) for EVADC_G11_RES11.
* To use register names with standard convension, please use EVADC_G11_RES11.
*/
#define EVADC_G11RES11 (EVADC_G11_RES11)

